package basic_1228;
/**
 * 연산자 기본 : 항목 및 우선순위
 * @author SangJun
 *
 */
public class OperationBasic {
	public static void main(String[] args) {
		
		/*
		 * 1. 연산자 기본
		 * - 단항 연산자 : ++, --, +, -, ~, !, (타입)
		 * - 이항 연산자
		 * 	: 산술연산자 ( *, /, +, -, %)
		 * 	: 쉬프트연산자 ( <<, >>, >>>) : 산술연산자 안에 쉬프트연산자 있음
		 * 	: 비교연산자 ( >, <, <=, >=, ==, !=, instanceof)
		 *  : 논리연산자 ( &, |, ^(XOR), &&, ||)
		 *  : 대입연산자 ( =, op=)
		 * - 삼항 연산자 : 조건식 ? true일때 : false일때
		 * 
		 * 2. 연산 우선순위
		 * - 산술 > 비교 > 논리 > 대입
		 * - 단항 > 이항 > 삼항
		 * - 단항 연산자와 대입 연산자를 제외한 모든 연산자의 진행방향은 왼쪽에서 오른쪽이다.
		 */	
	}
}
